<img src="https://github.com/danielscarvalho/data/blob/master/img/FIAP-logo.png?raw=True" style="float:right;" width="200px">

# DATA SCIENCE & STATISTICAL COMPUTING [》](https://www.fiap.com.br/)

## Dataframe & Python

### LAP Parte 1: “10 minutes to pandas"

https://pandas.pydata.org/docs/user_guide/10min.html

Sugestão: Colocar a página do Cookbook lado a lado com este notebook para realizar as operações.

In [70]:
import numpy as np
import pandas as pd

In [71]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : f538741432edf55c6b9fb5d0d496d2dd1d7c2457
python                : 3.11.2.final.0
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.22631
machine               : AMD64
processor             : Intel64 Family 6 Model 151 Stepping 2, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : pt_BR.cp1252

pandas                : 2.2.0
numpy                 : 1.26.4
pytz                  : 2024.1
dateutil              : 2.8.2
setuptools            : 65.5.0
pip                   : 24.0
Cython                : None
pytest                : None
hypothesis            : None
sphinx                : None
blosc                 : None
feather               : None
xlsxwriter            : None
lxml.etree            : None
html5lib              : None
pymysql               : None
psycopg2              : None
jinja2                : None
IPython               : 8.21.0
pandas_datareader     : None
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
gcsfs                 : None
matplotlib            : 3.8.3
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : None
pandas_gbq            : None
pyarrow               : None
pyreadstat            : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
zstandard             : None
tzdata                : 2024.1
qtpy                  : None
pyqt5                 : None

In [72]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [73]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [74]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.005854 -0.056529  1.318957  1.754324
2013-01-02 -0.089330 -1.504926  0.038613  0.275925
2013-01-03  0.955755 -0.529225  0.009346 -0.044305
2013-01-04 -1.522450  0.332117  0.392212  0.317510
2013-01-05  0.552299 -0.619995  0.451408  1.119261
2013-01-06  0.257901 -0.585592  0.529843 -1.004531

In [75]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [76]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [77]:
df.head()

                   A         B         C         D
2013-01-01 -1.005854 -0.056529  1.318957  1.754324
2013-01-02 -0.089330 -1.504926  0.038613  0.275925
2013-01-03  0.955755 -0.529225  0.009346 -0.044305
2013-01-04 -1.522450  0.332117  0.392212  0.317510
2013-01-05  0.552299 -0.619995  0.451408  1.119261

In [78]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.522450  0.332117  0.392212  0.317510
2013-01-05  0.552299 -0.619995  0.451408  1.119261
2013-01-06  0.257901 -0.585592  0.529843 -1.004531

In [79]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [80]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [81]:
df.to_numpy()

array([[-1.00585394, -0.05652874,  1.31895695,  1.75432445],
       [-0.08932961, -1.50492631,  0.03861344,  0.27592454],
       [ 0.95575486, -0.52922462,  0.00934612, -0.04430508],
       [-1.52244976,  0.33211714,  0.39221173,  0.3175099 ],
       [ 0.55229894, -0.61999475,  0.45140757,  1.11926115],
       [ 0.25790092, -0.58559246,  0.52984266, -1.00453141]])

In [82]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [83]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [84]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.141946 -0.494025  0.456730  0.403031
std    0.948862  0.619891  0.474962  0.953288
min   -1.522450 -1.504926  0.009346 -1.004531
25%   -0.776723 -0.611394  0.127013  0.035752
50%    0.084286 -0.557409  0.421810  0.296717
75%    0.478699 -0.174703  0.510234  0.918823
max    0.955755  0.332117  1.318957  1.754324

In [85]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.005854   -0.089330    0.955755   -1.522450    0.552299    0.257901
B   -0.056529   -1.504926   -0.529225    0.332117   -0.619995   -0.585592
C    1.318957    0.038613    0.009346    0.392212    0.451408    0.529843
D    1.754324    0.275925   -0.044305    0.317510    1.119261   -1.004531

In [86]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.754324  1.318957 -0.056529 -1.005854
2013-01-02  0.275925  0.038613 -1.504926 -0.089330
2013-01-03 -0.044305  0.009346 -0.529225  0.955755
2013-01-04  0.317510  0.392212  0.332117 -1.522450
2013-01-05  1.119261  0.451408 -0.619995  0.552299
2013-01-06 -1.004531  0.529843 -0.585592  0.257901

In [87]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02 -0.089330 -1.504926  0.038613  0.275925
2013-01-05  0.552299 -0.619995  0.451408  1.119261
2013-01-06  0.257901 -0.585592  0.529843 -1.004531
2013-01-03  0.955755 -0.529225  0.009346 -0.044305
2013-01-01 -1.005854 -0.056529  1.318957  1.754324
2013-01-04 -1.522450  0.332117  0.392212  0.317510

In [88]:
df["A"]

2013-01-01   -1.005854
2013-01-02   -0.089330
2013-01-03    0.955755
2013-01-04   -1.522450
2013-01-05    0.552299
2013-01-06    0.257901
Freq: D, Name: A, dtype: float64

In [89]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.005854 -0.056529  1.318957  1.754324
2013-01-02 -0.089330 -1.504926  0.038613  0.275925
2013-01-03  0.955755 -0.529225  0.009346 -0.044305

In [90]:
df[1:-1]

                   A         B         C         D
2013-01-02 -0.089330 -1.504926  0.038613  0.275925
2013-01-03  0.955755 -0.529225  0.009346 -0.044305
2013-01-04 -1.522450  0.332117  0.392212  0.317510
2013-01-05  0.552299 -0.619995  0.451408  1.119261

In [91]:
df

                   A         B         C         D
2013-01-01 -1.005854 -0.056529  1.318957  1.754324
2013-01-02 -0.089330 -1.504926  0.038613  0.275925
2013-01-03  0.955755 -0.529225  0.009346 -0.044305
2013-01-04 -1.522450  0.332117  0.392212  0.317510
2013-01-05  0.552299 -0.619995  0.451408  1.119261
2013-01-06  0.257901 -0.585592  0.529843 -1.004531

In [92]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.089330 -1.504926  0.038613  0.275925
2013-01-03  0.955755 -0.529225  0.009346 -0.044305
2013-01-04 -1.522450  0.332117  0.392212  0.317510

In [93]:
df.loc[dates[0]]

A   -1.005854
B   -0.056529
C    1.318957
D    1.754324
Name: 2013-01-01 00:00:00, dtype: float64

In [94]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.005854 -0.056529
2013-01-02 -0.089330 -1.504926
2013-01-03  0.955755 -0.529225
2013-01-04 -1.522450  0.332117
2013-01-05  0.552299 -0.619995
2013-01-06  0.257901 -0.585592

In [95]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.089330 -1.504926
2013-01-03  0.955755 -0.529225
2013-01-04 -1.522450  0.332117

In [96]:
df.loc[dates[0], "A"]

-1.0058539442495824

In [97]:
df.at[dates[0], "A"]

-1.0058539442495824

In [98]:
df.iloc[3]

A   -1.522450
B    0.332117
C    0.392212
D    0.317510
Name: 2013-01-04 00:00:00, dtype: float64

In [99]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.522450  0.332117
2013-01-05  0.552299 -0.619995

In [100]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.089330  0.038613
2013-01-03  0.955755  0.009346
2013-01-05  0.552299  0.451408

In [101]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.089330 -1.504926  0.038613  0.275925
2013-01-03  0.955755 -0.529225  0.009346 -0.044305

In [102]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.056529  1.318957
2013-01-02 -1.504926  0.038613
2013-01-03 -0.529225  0.009346
2013-01-04  0.332117  0.392212
2013-01-05 -0.619995  0.451408
2013-01-06 -0.585592  0.529843

In [103]:
df.iloc[1, 1]

-1.5049263139358213

In [104]:
df.iat[1, 1]

-1.5049263139358213

In [105]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-03  0.955755 -0.529225  0.009346 -0.044305
2013-01-05  0.552299 -0.619995  0.451408  1.119261
2013-01-06  0.257901 -0.585592  0.529843 -1.004531

In [106]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  1.318957  1.754324
2013-01-02       NaN       NaN  0.038613  0.275925
2013-01-03  0.955755       NaN  0.009346       NaN
2013-01-04       NaN  0.332117  0.392212  0.317510
2013-01-05  0.552299       NaN  0.451408  1.119261
2013-01-06  0.257901       NaN  0.529843       NaN

In [107]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -1.005854 -0.056529  1.318957  1.754324    one
2013-01-02 -0.089330 -1.504926  0.038613  0.275925    one
2013-01-03  0.955755 -0.529225  0.009346 -0.044305    two
2013-01-04 -1.522450  0.332117  0.392212  0.317510  three
2013-01-05  0.552299 -0.619995  0.451408  1.119261   four
2013-01-06  0.257901 -0.585592  0.529843 -1.004531  three

In [108]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.955755 -0.529225  0.009346 -0.044305   two
2013-01-05  0.552299 -0.619995  0.451408  1.119261  four

In [109]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1
df["F"] = s1

In [110]:
df.at[dates[0], "A"] = 0

In [111]:
df.iat[0, 1] = 0

In [112]:
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.318957  5.0  NaN
2013-01-02 -0.089330 -1.504926  0.038613  5.0  1.0
2013-01-03  0.955755 -0.529225  0.009346  5.0  2.0
2013-01-04 -1.522450  0.332117  0.392212  5.0  3.0
2013-01-05  0.552299 -0.619995  0.451408  5.0  4.0
2013-01-06  0.257901 -0.585592  0.529843  5.0  5.0